package HomeWork1;
/**
 Создать класс, который содержит int и char (не проинициализированные) и распечатать их значения.
 */
public class HW1_4 {
    int x1;
    char x2;
    public void n(){System.out.println(x1);}
    public void nn(){System.out.println(x2);}

    public static void main (String[] args){
        HW1_4 m = new HW1_4();
        m.nn();
        m.n();

    }
}
